In [21]:
# Joins and Merges in Pandas

In [22]:
import numpy as np
import pandas as pd

department_info = {
    "Department": ["HR", "Finance", "IT"],
    "Location": ["New York", "Chicago", "San Francisco"],
    "Manager": ["Riya", "Preeti", "Dhammdeep"]
}

df = pd.DataFrame(department_info)
df

  Department       Location    Manager
0         HR       New York       Riya
1    Finance        Chicago     Preeti
2         IT  San Francisco  Dhammdeep

In [23]:
data = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eva", "Alice"],
    "Age" : [24, 30, np.nan, 35, 28, 24],
    "Department" : ["HR", "Finance", "IT", "IT", "HR", "HR"],
    "Salary" : [50000, 60000, 55000, 70000, np.nan, 50000]
}

df2 = pd.DataFrame(data)
df2.drop_duplicates(inplace=True)
df2['Salary'].fillna(df2['Salary'].median(), inplace=True)
df2['Age'].fillna(df2['Age'].mean(), inplace=True)
df2

      Name    Age Department   Salary
0    Alice  24.00         HR  50000.0
1      Bob  30.00    Finance  60000.0
2  Charlie  29.25         IT  55000.0
3    David  35.00         IT  70000.0
4      Eva  28.00         HR  57500.0

In [24]:
# Concate the two DataFrames with default axis = 0 (rows)

pd.concat([df,df2], axis=0)

  Department       Location    Manager     Name    Age   Salary
0         HR       New York       Riya      NaN    NaN      NaN
1    Finance        Chicago     Preeti      NaN    NaN      NaN
2         IT  San Francisco  Dhammdeep      NaN    NaN      NaN
0         HR            NaN        NaN    Alice  24.00  50000.0
1    Finance            NaN        NaN      Bob  30.00  60000.0
2         IT            NaN        NaN  Charlie  29.25  55000.0
3         IT            NaN        NaN    David  35.00  70000.0
4         HR            NaN        NaN      Eva  28.00  57500.0

In [25]:
# Concat the two dataframes along columns

pd.concat([df,df2],axis = 1)

  Department       Location    Manager     Name    Age Department   Salary
0         HR       New York       Riya    Alice  24.00         HR  50000.0
1    Finance        Chicago     Preeti      Bob  30.00    Finance  60000.0
2         IT  San Francisco  Dhammdeep  Charlie  29.25         IT  55000.0
3        NaN            NaN        NaN    David  35.00         IT  70000.0
4        NaN            NaN        NaN      Eva  28.00         HR  57500.0

In [26]:
# Merge the two DataFrames on Department column
pd.merge(df, df2, on="Department", how="outer")  # You can use 'left', 'right', 'outer' for different types of joins

# outer explanation: It returns all records when there is a match in either left (df) or right (df2) DataFrame.

  Department       Location    Manager     Name    Age   Salary
0    Finance        Chicago     Preeti      Bob  30.00  60000.0
1         HR       New York       Riya    Alice  24.00  50000.0
2         HR       New York       Riya      Eva  28.00  57500.0
3         IT  San Francisco  Dhammdeep  Charlie  29.25  55000.0
4         IT  San Francisco  Dhammdeep    David  35.00  70000.0